---
kind: method
id: M:Autodesk.Revit.DB.AXMImportOptions.#ctor(Autodesk.Revit.DB.AXMImportOptions)
source: html/12d27723-6ae2-5dd8-af14-dce4ac1c552e.htm
---
# Autodesk.Revit.DB.AXMImportOptions.#ctor Method

Constructs a new instance of AXMImportOptions as a copy of the provided import options.

## Syntax (C#)
```csharp
public AXMImportOptions(
	AXMImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.AXMImportOptions`) - The AXM import options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null